tutorials/heatTransfer/chtMultiRegionFoam/heatExchanger/constant/porous/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

porousToair
{
    type            constantHeatTransfer;

    interpolationMethod cellVolumeWeight;
    nbrRegionName   air;
    master          true;

    nbrModel        airToporous;
    fields          (h);
    semiImplicit    no;
}


// ************************************************************************* //
